app/controllers/permissions_controller.rb

SELECT * FROM `permissions` WHERE (`permissions`.`id` = 1)
---
  def show
    @permission = Permission.find(params[:id])

INSERT INTO `permissions` (`name`, `created_at`, `updated_at`) VALUES('Read', '2010-07-22 19:56:05', '2010-07-22 19:56:05')
---
  def create
    @permission = Permission.new(params[:permission])

    respond_to do |format|
      if @permission.save