app/controllers/roles_controller.rb

  def show
    @role = Role.find(params[:id])
---
SELECT * FROM `roles` WHERE (`roles`.`id` = 1)

  def create
    @role = Role.new(params[:role])

    respond_to do |format|
      if @role.save
---
INSERT INTO `roles` (`name`, `created_at`, `updated_at`) VALUES('Admin', '2010-07-22 19:54:32', '2010-07-22 19:54:32')