app/controllers/role_permissions_controller.rb

  def show
    @role_permission = RolePermission.find(params[:id])
---
SELECT * FROM `role_permissions` WHERE (`role_permissions`.`id` = 1)

  def create
    @role_permission = RolePermission.new(params[:role_permission])

    respond_to do |format|
      if @role_permission.save
---
INSERT INTO `role_permissions` (`created_at`, `updated_at`, `id_role`, `id_permission`) VALUES('2010-07-22 22:54:43', '2010-07-22 22:54:43', 1, 5)