app/controllers/session_controller.rb

  def new
    login = params[:login]
    senha = params[:senha]
    debugger
    logout = params[:logout]

    if logout != nil
      session[:login] = nil
    else

      user_valid = User.user_is_valid?(login, senha)

      if user_valid
        flash[:user_winner] = "Login efetuado com sucesso !!"
        flash[:user_looser] = ""
        user = User.find(:first , :conditions => "(login = '#{login}' or email = '#{login}')")
        user.last_login = Time.now
        user.save
---
SELECT * FROM `users` WHERE ((login = 'Digite seu e-mail ou login' or email = 'Digite seu e-mail ou login') and password = 'Digite sua senha') LIMIT 1
UPDATE `users` SET `updated_at` = '2010-07-22 16:11:04', `last_login` = '2010-07-22 09:11:04' WHERE `id` = 1