app/controllers/user_roles_controller.rb

SELECT * FROM `user_roles` WHERE (`user_roles`.`id` = 1)
---
  def show
    @user_role = UserRole.find(params[:id])

SELECT * FROM `user_roles` WHERE (`user_roles`.`id` = 2)
---
  def edit
    @user_role = UserRole.find(params[:id])

INSERT INTO `user_roles` (`created_at`, `updated_at`, `role_id`, `user_id`) VALUES('2010-07-24 00:52:08', '2010-07-24 00:52:08', 1, 2)
---
  def create
    @user_role = UserRole.new(params[:user_role])

    respond_to do |format|
      if @user_role.save

SELECT * FROM `user_roles` WHERE (`user_roles`.`id` = 2)
UPDATE `user_roles` SET `updated_at` = '2010-07-24 00:38:38', `role_id` = 1 WHERE `id` = 2
---
  def update
    @user_role = UserRole.find(params[:id])

    respond_to do |format|
      if @user_role.update_attributes(params[:user_role])

SELECT * FROM `user_roles` WHERE (`user_roles`.`id` = 1)
DELETE FROM `user_roles` WHERE `id` = 1
---
  def destroy
    @user_role = UserRole.find(params[:id])
    @user_role.destroy