app/controllers/users_controller.rb

SELECT * FROM `roles` WHERE (`roles`.`login` = 'rfonteee') LIMIT 1
---
  def destroy
    @user = User.find(params[:id])
    role = Roles.find_by_login(@user.login)