app/controllers/users_controller.rb

SELECT * FROM `users` WHERE ((login = '')) LIMIT 1
---
  def index
    @users = User.find(:all)

SELECT * FROM `users` WHERE ((login = '')) LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "created_at", "last_login", "updated_at", "login", "password", "email") VALUES('rodrigo', '2010-07-16 17:57:36', 'rodrigo.fonte', '2010-07-16 17:57:36', 'rodriofonte', '12345', 'rodrigo.rodrigo@abrin.com.br')
INSERT INTO `roles` (`all`, `created_at`, `create_user`, `updated_at`, `login`, `view_all_users`) VALUES(NULL, '2010-07-22 17:08:57', NULL, '2010-07-22 17:08:57', 'params[:login]', NULL)
SELECT * FROM `user_roles` WHERE (`user_roles`.user_id = 9)
SELECT * FROM `users` WHERE ((login = '')) LIMIT 1
---
  def create
    @user = User.new(params[:user])
    @user.roles << Role.find(2)

SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2010-07-16 17:57:51', "email" = 'rodrigo.rodrigo@abril.com.br' WHERE "id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE ((login = '')) LIMIT 1
DELETE FROM `users` WHERE `id` = 2
SELECT * FROM `user_roles` WHERE ((user_id = 'user.id')) LIMIT 1
DELETE FROM `user_roles` WHERE `id` = 4
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy
    user_role = UserRole.find(:first , :conditions => "(user_id = '#{params[:id]}')")
    user_role.destroy